Revit 2027 API
InCanvasControlData.Position Property
 The position of the in-canvas control in model coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Position { get; set; }
Public Property Position As XYZ
	Get
	Set
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Position : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
InCanvasControlData Class
Autodesk.Revit.DB Namespace